try:
    print("Натисніть 1 для привітання")
    print("Натисніть 2 для початку роботи")
    print("Натисніть 3 для завершення роботи")
    x = float(input("Введіть 1, 2 або 3: "))
    if x == 1:
        print ("Вітаю! Для початку роботи з комп'ютером натисніть 2, для завершення - 3")
    if x == 2:
        print ("Ви почали роботу з ком'ютером")
    if x == 3:
        print ("Роботу з комп'ютером завершено")  
    
except ValueError:
    print("Не треба писати ніяких слів, тільки вибери цифру від 1 до 3")
